Revit 2026 API

# ItemFactoryBaseNewReferencePlane Method

---

Creates a new instance of ReferencePlane.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReferencePlane NewReferencePlane(
	XYZ bubbleEnd,
	XYZ freeEnd,
	XYZ cutVec,
	View pView
)
```
```vb
Public Function NewReferencePlane (
	bubbleEnd As XYZ,
	freeEnd As XYZ,
	cutVec As XYZ,
	pView As View
) As ReferencePlane
```
```cpp
public:
ReferencePlane^ NewReferencePlane(
	XYZ^ bubbleEnd,
	XYZ^ freeEnd,
	XYZ^ cutVec,
	View^ pView
)
```
```fsharp
member NewReferencePlane :
        bubbleEnd : XYZ *
        freeEnd : XYZ *
        cutVec : XYZ *
        pView : View -> ReferencePlane
```

#### Parameters

bubbleEnd XYZ
     The bubble end applied to reference plane.
freeEnd XYZ
     The free end applied to reference plane.
cutVec XYZ
     The cut vector apply to reference plane, should perpendicular to the vector (bubbleEnd-freeEnd).
pView View
     The specific view apply to the Reference plane.

#### Return Value

ReferencePlane The newly created reference plane.

The specific view is applied to the Reference plane only for certain view types: LegendDraftingViewDrawingSheet

#### Reference

ItemFactoryBase Class

Autodesk.Revit.Creation Namespace